In [0]:
import pandas as pd
import numpy as np

In [4]:
import os
os.getcwd()

'/content'

In [5]:
survey_data=pd.read_excel("P02_03.xlsx")
survey_data.head()

   Person          Age  Gender       State  Children  Salary            Opinion
0       1  Middle-aged       2       Texas         2   63017     Strongly agree
1       2  Middle-aged       2    Virginia         3  100302  Strongly disagree
2       3  Middle-aged       2  California         0  144043     Strongly agree
3       4        Young       2  California         0   36025              Agree
4       5  Middle-aged       1       Texas         0   97543            Neutral

In [6]:
survey_data.tail()

     Person          Age  Gender  ... Children  Salary            Opinion
394     395  Middle-aged       2  ...        0   60715            Neutral
395     396  Middle-aged       1  ...        2   91760           Disagree
396     397  Middle-aged       2  ...        1   82558  Strongly disagree
397     398  Middle-aged       1  ...        1   84880     Strongly agree
398     399  Middle-aged       2  ...        2   76933     Strongly agree

[5 rows x 7 columns]

In [7]:
survey_data.columns

Index(['Person', 'Age', 'Gender', 'State', 'Children', 'Salary', 'Opinion'], dtype='object')

In [8]:
survey_data.index

RangeIndex(start=0, stop=399, step=1)

In [9]:
survey_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 399 entries, 0 to 398
Data columns (total 7 columns):
Person      399 non-null int64
Age         399 non-null object
Gender      399 non-null int64
State       399 non-null object
Children    399 non-null int64
Salary      399 non-null int64
Opinion     399 non-null object
dtypes: int64(4), object(3)
memory usage: 21.9+ KB

In [10]:
survey_data.describe()

           Person      Gender    Children         Salary
count  399.000000  399.000000  399.000000     399.000000
mean   200.000000    1.586466    1.313283   78942.471178
std    115.325626    0.493085    1.022166   27236.865152
min      1.000000    1.000000    0.000000   20687.000000
25%    100.500000    1.000000    0.000000   58128.500000
50%    200.000000    2.000000    2.000000   79212.000000
75%    299.500000    2.000000    2.000000   95796.500000
max    399.000000    2.000000    3.000000  160134.000000

**a.	What is the average salary of all respondents based on their gender**

In [11]:
a=survey_data.groupby('Gender')
a['Salary'].mean()

Gender
1    80733.200000
2    77679.777778
Name: Salary, dtype: float64

**b.	What is the average salary of respondents of those who are female and have two childrens.**

In [19]:
female_data=survey_data[survey_data['Gender']==2]
female_data.head()

   Person          Age  Gender       State  Children  Salary            Opinion
0       1  Middle-aged       2       Texas         2   63017     Strongly agree
1       2  Middle-aged       2    Virginia         3  100302  Strongly disagree
2       3  Middle-aged       2  California         0  144043     Strongly agree
3       4        Young       2  California         0   36025              Agree
6       7  Middle-aged       2    Michigan         2   81799           Disagree

In [21]:
two_childrens=female_data[female_data['Children']==2]
two_childrens.head()

    Person          Age  Gender       State  Children  Salary         Opinion
0        1  Middle-aged       2       Texas         2   63017  Strongly agree
6        7  Middle-aged       2    Michigan         2   81799        Disagree
13      14      Elderly       2       Texas         2   67748         Neutral
14      15        Young       2       Texas         2   47172         Neutral
17      18      Elderly       2  California         2   66001         Neutral

In [0]:
avg_salary=two_childrens.Salary.mean()

In [27]:
print("the avg salary of female who are having two children is  {}".format(avg_salary))

the avg salary of female who are having two children is  77805.29629629629

***c.	Identify all respondents who strongly agree with the environmental policy***

In [44]:
environ_policy=survey_data[survey_data['Opinion']=='Strongly agree']
environ_policy.head()

    Person          Age  Gender       State  Children  Salary         Opinion
0        1  Middle-aged       2       Texas         2   63017  Strongly agree
2        3  Middle-aged       2  California         0  144043  Strongly agree
12      13  Middle-aged       1   Minnesota         1  115138  Strongly agree
24      25  Middle-aged       2    Michigan         2   93370  Strongly agree
27      28      Elderly       1    Illinois         2   62929  Strongly agree

**Environmental_policy based on Gender**

In [46]:
environ_policy.groupby(['Gender','Opinion']).count()

                       Person  Age  State  Children  Salary
Gender Opinion
1      Strongly agree      40   40     40        40      40
2      Strongly agree      46   46     46        46      46

In [47]:
environ_policy.count()

Person      86
Age         86
Gender      86
State       86
Children    86
Salary      86
Opinion     86
dtype: int64